﻿/* both are integer numbers meaning 'x of n' */
"%1$@/%2$@" = "%1$@/%2$@";

/* MainViewController */
"Access Denied" = "Brak dostępu";

/* MainViewController */
"Access Restricted" = "Dostęp ograniczony";

/* No comment provided by engineer. */
"Account" = "Konto";

/* No comment provided by engineer. */
"ADD" = "Dodaj";

/* No comment provided by engineer. */
"Add a Folder" = "Dodaj katalog";

/* No comment provided by engineer. */
"Add a location (optional)" = "Dodaj lokalizację (opcjonalnie)";

/* No comment provided by engineer. */
"Add notes (optional)" = "Dodaj notatkę (opcjonalnie)";

/* No comment provided by engineer. */
"Add Server" = "Dodaj serwer";

/* ShareExtension.MainViewController */
"Adding…" = "Dodawanie…";

/* No comment provided by engineer. */
"Allow anyone to remix and share?" = "Zezwolić na remiksowanie i udostępnianie?";

/* No comment provided by engineer. */
"Allow commercial use?" = "Zezwolić na użytek komercyjny?";

/* No comment provided by engineer. */
"Archive" = "Archiwizuj";

/* No comment provided by engineer. */
"Archive Folder" = "Archiwizuj katalog";

/* No comment provided by engineer. */
"Archived Folders" = "Zarchiwizowane katalogi";

/* ManagementViewController */
"Back" = "Wstecz";

/* DataUsageViewController */
"Better Quality" = "Lepsza jakość";

/* No comment provided by engineer. */
"Browse Existing" = "Przeglądaj istniejące";

/* No comment provided by engineer. */
"Browse Existing Folders" = "Przeglądaj istniejące katalogi";

/* MainViewController */
"Camera Roll" = "Rolka z aparatu";

/* MainViewController, AlertHelper */
"Cancel" = "Anuluj";

/* ShareExtension.MainViewController */
"Choose a Project" = "Wybierz projekt";

/* No comment provided by engineer. */
"Close" = "Zamknij";

/* Conduit */
"Configuration invalid." = "Nieprawidłowa konfiguracja.";

/* ShareExtension.MainViewController */
"Couldn't import item!" = "Nie udało się zaimportować elementu!";

/* No comment provided by engineer. */
"Create" = "Utwórz";

/* No comment provided by engineer. */
"Create a New Folder" = "Utwórz nowy katalog";

/* MainViewController, DarkroomViewController, PrivateServerViewController, InternetArchiveViewController, ManagementViewController, Main.storyboard */
"Done" = "Gotowe";

/* No comment provided by engineer. */
"Edit" = "Edytuj";

/* No comment provided by engineer. */
"Edit Media" = "Edytuj multimedia";

/* No comment provided by engineer. */
"Edit Media Info" = "Edytuj informacje o multimediach";

/* No comment provided by engineer. */
"Edit Multiple" = "Edytuj kilka";

/* Placeholder 1 is 'Tor' */
"Enable %1$@ to protect your media in transit." = "Włącz %1$@, aby chronić multimedia podczas przesyłania.";

/* Placeholder is 'Tor' */
"Enable \"Transfer via %@ only\"" = "Włącz „Przesyłaj wyłącznie przez %@”";

/* MiscSettingsViewController */
"Enable ProofMode" = "Włącz ProofMode";

/* UploadCell */
"Encoding file…" = "Kodowanie pliku…";

/* No comment provided by engineer. */
"Encrypt" = "Szyfruj";

/* AlertHelper */
"Error" = "Błąd";

/* Conduit */
"Failed after too many retries." = "Nie udało się – zbyt wiele prób.";

/* No comment provided by engineer. */
"Files" = "Pliki";

/* FlagInfoAlert */
"Flag Significant Content" = "Oznacz istotną zawartość";

/* No comment provided by engineer. */
"Folder" = "Katalog";

/* No comment provided by engineer. */
"Folder Already Exists" = "Katalog już istnieje";

/* No comment provided by engineer. */
"Folder Name" = "Nazwa katalogu";

/* No comment provided by engineer. */
"General" = "Ogólne";

/* ClaimViewController */
"Get Started" = "Rozpocznij";

/* ShareExtension.MainViewController */
"Go to the app to upload!" = "Otwórz aplikację, aby przesłać!";

/* FlagInfoAlert, BatchInfoAlert */
"Got it" = "Rozumiem";

/* ShareExtension.MainViewController */
"Import" = "Importuj";

/* No comment provided by engineer. */
"In the side menu, you can add another server and connect to multiple servers" = "W menu bocznym możesz dodać kolejny serwer i połączyć się z wieloma serwerami";

/* Error+friendlyMessage */
"Incorrect username or password" = "Nieprawidłowa nazwa użytkownika lub hasło ";

"Email" = "E-mail";

"Incorrect email or password" = "Nieprawidłowy adres e-mail lub hasło";

/* HeaderView */
"Just now" = "Przed chwilą";

/* place holder is Creative Commons Licensing. */
"Upload media to Nextcloud or the Internet Archive to keep your media verifiable, safe, and organized for the long term.\n\nChoose %@." = "Przesyłaj multimedia do Nextcloud lub Internet Archive, aby były weryfikowalne, bezpieczne i uporządkowane na dłużej. \n\nWybierz %@.";


/* No comment provided by engineer. */
"Learn more about Creative Commons." = "Dowiedz się więcej o Creative Commons.";

/* No comment provided by engineer. */
"Media Compression" = "Kompresja multimediów";

/* No comment provided by engineer. */
"Metadata" = "Metadane";

/* No comment provided by engineer. */
"My Media" = "Moje multimedia";

/* No comment provided by engineer. */
"New Folder" = "Nowy katalog";

/* NewProjectViewController, ShareExtension.MainViewController */
"New Project" = "Nowy projekt";

/* No comment provided by engineer. */
"Next" = "Dalej";

/* MainViewController */
"No albums" = "Brak albumów";

/* UploadManager */
"No URL provided." = "Nie podano adresu URL.";

/* AnalyticsCell */
"OK" = "OK";

/* No comment provided by engineer. */
"Once uploaded, you will not be able to edit media." = "Po przesłaniu nie będzie można już edytować multimediów.";

/* DataUsageViewController */
"Only upload media when you are connected to Wi-Fi" = "Przesyłaj multimedia tylko, gdy masz połączenie z siecią Wi-Fi";

/* Bundle+displayName */
"OpenArchive" = "OpenArchive";

/* PrivateServerViewController */
"Password" = "Hasło";

/* No comment provided by engineer. */
"Photo Gallery" = "Galeria zdjęć";

/* No comment provided by engineer. */
"Please choose another name/folder or use the existing one instead." = "Wybierz inną nazwę/katalog lub użyj istniejącego.";

/* MainViewController */
"Please go to the Settings app to grant this app access to your camera, if you want to upload photos or videos." = "Aby móc przesyłać zdjęcia lub filmy, przejdź do Ustawień i przyznaj tej aplikacji dostęp do aparatu.";

/* MainViewController */
"Please go to the Settings app to grant this app access to your photo library, if you want to upload photos or videos." = "Aby móc przesyłać zdjęcia lub filmy, przejdź do Ustawień i przyznaj tej aplikacji dostęp do biblioteki zdjęć.";

/* placeholder is '+' */
"Press and hold the %@ button to select other files than photos and movies." = "Press and hold the %@ button to select other files than photos and movies.";

/* No comment provided by engineer. */
"Press and hold to select and edit multiple media." = "Naciśnij i przytrzymaj, aby wybrać i edytować kilka multimediów.";

/* No comment provided by engineer. */
"Press the button below to add media" = "Naciśnij poniższy przycisk, aby dodać multimedia";

/* PreviewViewController */
"Preview" = "Podgląd";

/* MenuViewController */
"Privacy Policy" = "Polityka prywatności";

/* PrivateServerViewController, Main.storyboard */
"Private (WebDAV) Server" = "Prywatny serwer WebDAV";

/* No comment provided by engineer. */
"Private Server" = "Serwer prywatny";

/* No comment provided by engineer. */
"ProofMode" = "ProofMode";

/* HeaderView */
"Ready to upload" = "Gotowe do przesłania";

/* PreviewViewController, MenuViewController, ManagementViewController, RemoveProjectAlert */
"Remove" = "Usuń";

/* No comment provided by engineer. */
"Remove Folder" = "Usuń katalog";

/* BaseServerViewController, EditProjectViewController, RemoveProjectAlert */
"Remove from App" = "Usuń z aplikacji";

/* RemoveAssetAlert */
"Remove Media" = "Usuń multimedia";

/* RemoveAssetAlert */
"Remove Media from %@" = "Usuń multimedia z %@";

/* No comment provided by engineer. */
"Remove Server" = "Usuń serwer";

/* No comment provided by engineer. */
"Require them to share like you have?" = "Wymagać udostępniania na tych samych zasadach?";

/* ManagementViewController */
"Retry" = "Spróbuj ponownie";

/* ClaimViewController */
"Secure Mobile Media Preservation" = "Bezpieczne przechowywanie multimediów mobilnych";

/* No comment provided by engineer. */
"Security" = "Bezpieczeństwo";

/* No comment provided by engineer. */
"Choose a new or existing folder to save your media in." = "Wybierz nowy lub istniejący katalog, aby zapisać w nim multimedia.";

/* No comment provided by engineer. */
"Server" = "Serwer";

/* No comment provided by engineer. */
"Server Info" = "Dane serwera";

/* No comment provided by engineer. */
"Server Name (Optional)" = "Nazwa serwera (opcjonalnie)";

/* PrivateServerViewController */
"Server URL" = "Adres URL serwera";

/* No comment provided by engineer. */
"Servers" = "Serwery";

/* No comment provided by engineer. */
"Set creative commons licenses for folders on this server." = "Ustaw licencje Creative Commons dla katalogów na tym serwerze.";

/* MainViewController */
"Settings" = "Ustawienia";

/* No comment provided by engineer. */
"Share" = "Chroń";

/* Placeholders will be replaced by newline - ClaimViewController */
"Share%1$@Archive%1$@Verify%1$@Encrypt" = "Chroń%1$@Archiwizuj%1$@Weryfikuj%1$@Szyfruj";

/* DarkroomHelper */
"Significant Content" = "Istotna zawartość";

/* No comment provided by engineer. */
"Skip" = "Pomiń";

/* DataUsageViewController */
"Smaller Size" = "Mniejszy rozmiar";

/* MainViewController */
"Sorry, you are not allowed to view the camera roll." = "Przepraszamy, nie masz uprawnień do przeglądania rolki z aparatu.";

/* MainViewController */
"Tap here to change" = "Dotknij tutaj, aby zmienić";

/* No comment provided by engineer. */
"To get started, connect to a server to store your media." = "Aby rozpocząć, połącz się z serwerem do przechowywania multimediów.";

/* No comment provided by engineer. */
"To get started, please add a folder" = "To get started, please add a folder";

/* No comment provided by engineer. */
"Unarchive Folder" = "Przywróć katalog z archiwum";

/* UploadManager */
"Unknown error." = "Nieznany błąd.";

/* Project */
"Unnamed Project" = "Projekt bez nazwy";

/* PreviewViewController */
"Upload" = "Prześlij";

/* PreviewViewController */
"Upload to %@" = "Prześlij do %@";

/* Upload info alert title */
"Upload unsuccessful" = "Przesyłanie nie powiodło się";

/* No comment provided by engineer. */
"Uploading is paused" = "Przesyłanie zostało wstrzymane";

/* ManagementViewController */
"Uploading…" = "Przesyłanie…";

"Edit Queue" = "Edytuj kolejkę";

/* BaseServerViewController */
"Username" = "Nazwa użytkownika";

/* No comment provided by engineer. */
"Verify" = "Weryfikuj";

/* No comment provided by engineer. */
"Version %1$@, build %2$@" = "Wersja %1$@, kompilacja %2$@";

/* ManagementViewController */
"Waiting…" = "Oczekiwanie…";

/* No comment provided by engineer. */
"Welcome!" = "Witaj!";

/* No comment provided by engineer. */
"When you flag an item, it is routed into a subfolder within the chosen folder on the private server." = "Gdy oznaczysz element, zostanie on przeniesiony do podkatalogu w wybranym katalogu na serwerze prywatnym.";

/* No comment provided by engineer. */
"Wi-Fi not connected" = "Brak połączenia z siecią Wi-Fi";

/* Placeholder is a server type or name */
"You have successfully connected to %@!" = "Połączono z serwerem %@!";

"Internet Archive" = "Internet Archive";

"Do not show me this again" = "Nie pokazuj ponownie";

"Upload your media to a free public account on the Internet Archive." = "Przesyłaj multimedia na darmowe publiczne konto w Internet Archive";

"No Account?" = "Nie masz konta?";

"Create one" = "Utwórz konto";

"Setup Passcode" = "Ustaw kod dostępu";

"Confirm Passcode" = "Potwierdź kod dostępu";

"Set Passcode" = "Ustaw kod dostępu";

"Make sure you remember this pin. If you forget it, you will need to reset the app, and all in-app data will be erased." = "Zapamiętaj ten PIN. Jeśli go zapomnisz, konieczne będzie zresetowanie aplikacji, co spowoduje usunięcie wszystkich danych. ";

"Error!"= "Błąd!";

"Folder name cannot be empty" = "Nazwa katalogu nie może być pusta";

"Rename folder" = "Zmień nazwę katalogu";

"Select media" = "Wybierz multimedia";

"Remove folder from app" = "Usuń katalog z aplikacji";

"Tap the button below to add media" = "Dotknij poniższego przycisku, aby dodać multimedia";

"Tap the button below to add a server" = "Dotknij poniższego przycisku, aby dodać serwer";

"Tap the button below to add a folder" = "Dotknij poniższego przycisku, aby dodać katalog";
"Add new server" = "Dodaj nowy serwer";

/* Placeholder is 'ProofMode' */
"Authenticate and verify your media with sha256 hashes and %@." = "Authenticate and verify your media with sha256 hashes and %@.";

/* Placeholder texts are 'Save' and 'Tor' */
"%@ always uploads over TLS (Transport Layer Security) to protect your media in transit. \nTo further enhance security, enable %@ to prevent interception of your media from your phone to the server." = "%@ zawsze przesyła dane przez TLS (Transport Layer Security), co chroni multimedia podczas transferu.\nAby dodatkowo zwiększyć bezpieczeństwo i uniemożliwić przechwycenie multimediów przesyłanych z telefonu na serwer, włącz %@.";

"Creative Commons Licensing" = "Licencjonowanie Creative Commons";

/* Onboarding Secure Text */
"Send your media securely to private servers and lock the app with a pin." = "Bezpiecznie przesyłaj multimedia na serwery prywatne i zabezpiecz aplikację kodem PIN.";

"Bulk Edit Media Info" = "Edycja zbiorcza informacji o multimediach";

"Press and hold to select and edit multiple media items." = "Naciśnij i przytrzymaj, aby wybrać i edytować kilka multimediów.";
"Archive Project" = "Archiwizuj projekt";

"Unarchive Project" = "Przywróć projekt z archiwum";

"Success!" = "Sukces!";

"You have renamed folder successfully." = "Nazwa katalogu została zmieniona.";

/* Proofmode description */
"To help verify where your media was captured, ProofMode gathers data from nearby cell towers to corroborate your location. To add credibility and context, it then includes a separate metadata file with your media*. iOS requires location access to collect this information." = "Aby ustalić, gdzie utworzono multimedia, ProofMode zbiera dane z pobliskich wież komórkowych w celu potwierdzenia lokalizacji. Następnie, aby zwiększyć wiarygodność i zapewnić kontekst, dołącza do multimediów oddzielny plik z metadanymi*. iOS wymaga dostępu do lokalizacji, aby móc gromadzić te informacje.";

/* Proofmode description */
"*Neither **_Save_** nor **_OpenArchive_** will be able to access or store this location data, it will only be accessible to those with access to the server files." = "***_Save_** i **_OpenArchive_** nie mają dostępu do danych lokalizacyjnych ani nie mogą ich przechowywać. Dane te są widoczne wyłącznie dla osób z dostępem do plików na serwerze.";

/* Proofmode description */
"ProofMode is a way to enhance the authentication and verification of multimedia content. "= "ProofMode to rozwiązanie służące do usprawnienia procesu uwierzytelniania i weryfikacji treści multimedialnych. ";

"Learn more here." = "Dowiedz się więcej tutaj.";

"Media Servers" = "Serwery multimediów";

/* Upload error alert description */
"Unable to upload due to session error, please try again or contact support" = "Nie można przesłać – błąd sesji. Spróbuj ponownie lub skontaktuj się z działem wsparcia.";

"You have changed your server settings successfully." = "Ustawienia serwera zostały zmienione.";

"Lock app with passcode" = "Zabezpiecz aplikację kodem dostępu";

"Manage your servers" = "Zarządzaj serwerami";

"Manage your archived folders" = "Zarządzaj zarchiwizowanymi katalogami";

"Turn on Onion Routing" = "Włącz trasowanie cebulowe";

"Transfer via the Tor Network only" = "Przesyłaj wyłącznie przez sieć Tor";

"Theme" = "Motyw";

"Save by OpenArchive" = "Save by OpenArchive";

"Discover the Save app" = "Poznaj aplikację Save";

"Terms and Privacy"= "Regulamin i Polityka prywatności";

"Read our Terms and Privacy Policy"= "Zapoznaj się z Regulaminem i Polityką prywatności";

"Version" = "Wersja";

"Disable Passcode" = "Wyłącz kod dostępu";

"Are you sure you want to disable the passcode?" = "Czy na pewno chcesz wyłączyć kod dostępu?";

"Yes" = "Tak";

"System" = "Systemowy";

"Light" = "Jasny";

"Dark" = "Ciemny";

"Setup Complete" = "Konfiguracja zakończona";

"You can add multiple private servers and one IA Account at any time." = "Możesz dodać kilka serwerów prywatnych oraz jedno konto IA w dowolnym momencie.";

"Select a Server" = "Wybierz serwer";

"Connect to a secure \nWebDAV server" = "Połącz się z bezpiecznym\nserwerem WebDAV";

"Connect to a free \npublic server" = "Połącz się z darmowym\nserwerem publicznym";

"Please name your folder" = "Nazwij katalog";

"This folder will be created on your server and added to Save." = "Ten katalog zostanie utworzony na serwerze i dodany do aplikacji Save.";

"Enter folder name"= "Wprowadź nazwę katalogu";

"You have added a folder successfully." = "Katalog został dodany.";

"Add Media" = "Dodaj multimedia";

/* placeholder is + icon */
"Tap %@ to pick from image gallery or press and hold to add media from other apps." = "Dotknij %@, aby wybrać z galerii zdjęć lub naciśnij i przytrzymaj, aby dodać multimedia z innych aplikacji.";

"Please enable location access in Settings to use ProofMode." = "Aby korzystać z ProofMode, włącz dostęp do lokalizacji w Ustawieniach.";

"Location Permission Required" = "Wymagany dostęp do lokalizacji";

"Open Settings" = "Ustawienia";

"Onion routing under development" = "Trasowanie cebulowe w przygotowaniu";
"This feature is currently under development. For now, you can use Orbot or any VPN of your choice to enhance your privacy and security." = "Ta funkcja jest obecnie w fazie rozwoju. Na razie możesz korzystać z aplikacji Orbot lub dowolnej innej sieci VPN, aby zwiększyć swoją prywatność i bezpieczeństwo.";

"Orbot" = "Orbot";

"Download Orbot" = "Pobierz aplikację Orbot";

"Learn More" = "Dowiedz się więcej";

"Waive all restrictions, requirements, and attribution (CC0)." = "Zrezygnuj ze wszystkich ograniczeń, wymogów i obowiązku podania autora (CC0).";

"Are you sure you want to remove your project?"= "Czy na pewno chcesz usunąć projekt?";

"Are you sure you want to remove this server from the app?" = "Czy na pewno chcesz usunąć ten serwer z aplikacji?";

"Warning!"= "Uwaga!";

"Enter your Passcode" = "Wprowadź kod dostępu";

"Passcodes do not match. Try again." = "Kody dostępu nie są zgodne. Spróbuj ponownie.";

"Select All" = "Zaznacz wszystko";

"Deselect All" = "Odznacz wszystko";

"Add media from" = "Dodaj multimedia z";

"Camera" = "Aparat";

"No archived folders found."= "Nie znaleziono zarchiwizowanych katalogów.";

"No servers added yet."= "Nie dodano jeszcze żadnych serwerów.";

"Folder archived successfully."= "Katalog został zarchiwizowany.";

/* Private server login screen */
"A server with the specified hostname could not be found." = "Nie znaleziono serwera o podanej nazwie hosta.";

/* Private server login screen */
"This server already exists. Please create another server." = "Ten serwer już istnieje. Utwórz inny.";

/* Private server login screen */
"Connect to a WebDAV-compatible servers, e.g. Nexcloud and ownCloud." = "Połącz się z serwerem zgodnym z WebDAV, np. Nextcloud lub ownCloud.";

"License" = "Licencja";

"Server Name" = "Nazwa serwera";

"Proceed to upload" = "Przejdź do przesyłania";

"Actually, let me edit" = "Chcę jeszcze edytować";

"Choose a licence" = "Choose a licence";

"Name your server and choose a licence" = "Name your server and choose a licence";

"Allow any connection" = "Allow any connection";
